//
//  main.swift
//  5thLesson 2ndMonth Home work
//
//  Created by Islam on 3/12/22.
//
//1. Создать протокол Car
//указать обязательное наличие свойств: марка, модель, год выпуска и страна производителя
//и метода ShowInfo(будет показывать всю информацию об авто)
//Создать структуры Пикап, Джип, Кроссовер используя протокол и добавить свойства для каждого класса по его специфике
//После всего - создать по 3 объекта каждого cтруктуры и вызвать функцию ShowInfo у каждого из них
//
//2. Создать протокол Товар
//Указать параметры - название, цена, срок годности, вес
//После чего создать структуру Еда, Напитки, Мыломойка, Техника
//Добавить по 5 объектов каждой структуры
//После чего в консоли имитировать работу службы доставки и в диалоге с клиентом оформить заказ:
//Имя Фамилия
//Дата заказа
//Время заказа
//Примерное время доставки
//Цена за доставку
//Общая сумма заказа
//Оценка клиента
//
//1. Задание
import Foundation
//var array = [Car]()
//var car1 = Car(brand: "BMW", model: "M8 Competition Coupe", year: 2022, country: "Germany")
//array.append(car1)
//for car in array{
//    car.showInfo()
//}
//var carsArray = [Cars]()
//var carsArray1: [Cars] = [Pickup(kind: "Пикап-гигант", category: "Транспортное средство, предназначенное для перевозки пассажиров и грузов, имеющее, помимо места водителя, более восьми мест для сидения, относится к категории M."), Jeep(kind: "Массивная махина", category: "Ставят категорию Д давно, по крайней мере с 2005 года точно."), Crossover(kind: "Универсал повышенной проходимости", category: "Компактные кроссоверы‎")]
//for i in carsArray1{
//    if i is Pickup{
//        print("Pickup")
//    }else if i is Jeep{
//        print("Jeep")
//    }else if i is Crossover{
//        print("Crossover")
//    }
//    i.showInfo()
//}

//2. Задание
